---
kind: other
id: Methods.T:Autodesk.Revit.DB.Plumbing.PipeScheduleType
source: html/74a2c70a-732c-1c5a-2eb0-cb0e4cf2a515.htm
---
# PipeScheduleType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.